ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.h
    /* Clocks management **********************************************************/
    void TIM_InternalClockConfig(TIM_TypeDef* TIMx);
    void TIM_ITRxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource);
    void TIM_TIxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_TIxExternalCLKSource,
            uint16_t TIM_ICPolarity, uint16_t ICFilter);
    void TIM_ETRClockMode1Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
            uint16_t ExtTRGFilter);
    void TIM_ETRClockMode2Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler,
            uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter);

    /* Synchronization management *************************************************/
    void TIM_SelectInputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource);
    void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_TRGOSource);
    void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode);
    void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_MasterSlaveMode);
    void TIM_ETRConfig(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
            uint16_t ExtTRGFilter);

    /* Specific interface management **********************************************/
    void TIM_EncoderInterfaceConfig(TIM_TypeDef* TIMx, uint16_t TIM_EncoderMode,
            uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity);
    void TIM_SelectHallSensor(TIM_TypeDef* TIMx, FunctionalState NewState);

    /* Specific remapping management **********************************************/
    void TIM_RemapConfig(TIM_TypeDef* TIMx, uint16_t TIM_Remap);

#ifdef __cplusplus
}
#endif

#endif /*__STM32F4xx_TIM_H */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
